:PROPERTIES:
:ID:       2bf4fc73-ec8d-46ca-9d62-3e419b047039
:END:
#+TITLE: FRC: Build pathplanner app for flatpak
#+CATEGORY: slips
#+TAGS:
** Generate Docs

Apply patch

#+begin_example diff
diff --git a/pathplannerlib/build.gradle b/pathplannerlib/build.gradle
index 6809929..a2b0d2e 100644
--- a/pathplannerlib/build.gradle
+++ b/pathplannerlib/build.gradle
@@ -1,3 +1,4 @@
+
 plugins {
     id 'cpp'
     id 'java'
@@ -27,6 +28,12 @@ if (project.hasProperty('releaseMode')) {
     wpilibRepositories.addAllDevelopmentRepositories(project)
 }

+configurations {
+    umlDoclet
+}
+
+apply plugin: 'java'
+
 // Apply C++ configuration
 apply from: 'config.gradle'

@@ -51,6 +58,8 @@ dependencies {
     testImplementation 'org.junit.jupiter:junit-jupiter-params:5.9.0'
     testRuntimeOnly 'org.junit.jupiter:junit-jupiter-engine:5.9.0'
     testRuntimeOnly "us.hebi.quickbuf:quickbuf-runtime:1.3.2"
+
+    umlDoclet "nl.talsmasoftware:umldoclet:2.2.1"
 }

 // Set up exports properly
@@ -162,6 +171,10 @@ javadoc {
     exclude 'org/json/simple/**'
     options {
         links 'https://docs.oracle.com/en/java/javase/11/docs/api/', 'https://github.wpilib.org/allwpilib/docs/release/java/'
+        linkSource true
+        docletpath = configurations.umlDoclet.files.asType(List)
+        doclet "nl.talsmasoftware.umldoclet.UMLDoclet"
+        addBooleanOption "createPumlFiles", true
     }
 }


#+end_example

Generate docs

#+begin_src shell
./gradlew javadoc
#+end_src

Copy all =package.svg=

#+begin_src shell
find /data/ecto/frc/pathplanner/pathplannerlib/build/ \
    -name 'package.svg' -type f -printf '%p %p\n'
#+end_src

#+RESULTS:
| /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/controllers/package.svg | /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/controllers/package.svg |
| /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/util/package.svg        | /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/util/package.svg        |
| /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/util/swerve/package.svg | /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/util/swerve/package.svg |
| /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/commands/package.svg    | /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/commands/package.svg    |
| /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/path/package.svg        | /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/path/package.svg        |
| /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/auto/package.svg        | /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/auto/package.svg        |
| /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/trajectory/package.svg  | /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/trajectory/package.svg  |
| /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/config/package.svg      | /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/config/package.svg      |
| /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/pathfinding/package.svg | /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/pathfinding/package.svg |
| /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/events/package.svg      | /data/ecto/frc/pathplanner/pathplannerlib/build/docs/javadoc/com/pathplanner/lib/events/package.svg      |

... so close

#+begin_src shell
find /data/ecto/frc/pathplanner/pathplannerlib/build/ \
    -name 'package.svg' -type f -printf '%p %p\n' \
    | sed -e 's/ .*javadoc\// /g' \
    | sed -E 's/ ([^\/]+)\// \1\./g'

# | xargs -I\{\} cp \{\} . # ....
#+end_src


